## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                        NAME                         |
|----------|-----------------------------------------------------|
| recreate | `aws_rds_cluster.forms`                             |
|          | `aws_secretsmanager_secret_version.database_secret` |
|          | `aws_secretsmanager_secret_version.database_url`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_rds_cluster.forms must be replaced
-/+ resource "aws_rds_cluster" "forms" {
      + apply_immediately                   = true
      ~ arn                                 = "arn:aws:rds:ca-central-1:687401027353:cluster:forms-staging-db-cluster" -> (known after apply)
      ~ availability_zones                  = [
          - "ca-central-1a",
          - "ca-central-1b",
          - "ca-central-1d",
        ] -> (known after apply)
      - backtrack_window                    = 0 -> null
      + cluster_identifier_prefix           = (known after apply)
      ~ cluster_members                     = [] -> (known after apply)
      ~ cluster_resource_id                 = "cluster-QDUZMV5OOLEWNET4YO6K3Q44WY" -> (known after apply)
      ~ db_cluster_parameter_group_name     = "default.aurora-postgresql13" -> (known after apply)
      ~ enable_http_endpoint                = true -> false
      - enabled_cloudwatch_logs_exports     = [] -> null
      ~ endpoint                            = "forms-staging-db-cluster.cluster-cbjnceyjvtyl.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_mode                         = "serverless" -> "provisioned" # forces replacement
      ~ engine_version_actual               = "13.9" -> (known after apply)
      ~ hosted_zone_id                      = "Z1JG78A3UK1DU3" -> (known after apply)
      - iam_database_authentication_enabled = false -> null
      ~ iam_roles                           = [] -> (known after apply)
      ~ id                                  = "forms-staging-db-cluster" -> (known after apply)
      ~ kms_key_id                          = "arn:aws:kms:ca-central-1:687401027353:key/d41d5c76-cae4-4499-ba37-d34fc55e2599" -> (known after apply)
      ~ port                                = 5432 -> (known after apply)
      ~ preferred_maintenance_window        = "sun:05:39-sun:06:09" -> (known after apply)
      + reader_endpoint                     = (known after apply)
        tags                                = {
            "CostCentre" = "forms-platform-staging"
            "Name"       = "forms-staging-db-cluster"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

      - scaling_configuration {
          - auto_pause               = false -> null
          - max_capacity             = 8 -> null
          - min_capacity             = 2 -> null
          - seconds_until_auto_pause = 300 -> null
          - timeout_action           = "RollbackCapacityChange" -> null
        }
    }

  # aws_secretsmanager_secret_version.database_secret must be replaced
-/+ resource "aws_secretsmanager_secret_version" "database_secret" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:database-secret-vHJuTe" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:database-secret-vHJuTe|0F83821A-6CF8-4B6C-BBA5-18CBE02D69A4" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "0F83821A-6CF8-4B6C-BBA5-18CBE02D69A4" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.database_url must be replaced
-/+ resource "aws_secretsmanager_secret_version" "database_url" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3|FF00B695-F9A1-41AB-B815-7CEFEFCDA814" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "FF00B695-F9A1-41AB-B815-7CEFEFCDA814" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ database_secret_arn     = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:database-secret-vHJuTe" -> (known after apply)
  ~ database_url_secret_arn = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3" -> (known after apply)
  ~ rds_cluster_arn         = "arn:aws:rds:ca-central-1:687401027353:cluster:forms-staging-db-cluster" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_url"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
